// Напишите программу, которая на вход принимает число и выдает его квадрат.
//Например 4 > 16.
Console.Write("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine()); // "7" > 7
int square = number * number;
Console.Write($"Квадрат числа:  {square}");
